# coding=utf-8
from comnfunc import  *

if __name__ == '__main__':

    # lst = ['丫','卡','井','勺','儿','反','币','支','五','去']#,'白','百','米','网','牙','门','羊','末','因','只','三','义','人','云','叶','斤','方','空','见','子']
    # lst = ['白','百','米','网','牙','门','羊','末','因','只','三','义','人','云','叶','斤','方','空','见','子']
    # lst = ['小', '火', '山', '自', '凡', '大', '木', '田', '正', '冬', '闪', '甘', '可', '央', '戊', '尔', '父', '水', '在', '西', '成', '禾']
    # lst = ['乎', '寸', '川', '交', '穴']#, '大', '木', '田', '正', '冬', '闪', '甘', '可', '央', '戊', '尔', '父', '水', '在', '西', '成', '禾']
    # lst = [ '乎', '寸','交']#, '大', '木', '田', '正', '冬', '闪', '甘', '可', '央', '戊', '尔', '父', '水', '在', '西', '成', '禾']
    # lst = ['尔', '寸', '乎', '余', '孔', '戈', '代', '民', '必', '习', '式', '长', '氏', '川', '交', '穴']
    # lst = ['尔', '寸', '乎', '余', '戈', '代', '民', '必', '习', '式', '长', '氏', '交']
    lst = ['大']#, '寸', '乎', '余', '戈', '代', '民', '必', '习', '式', '长', '氏', '交']

    for wd in lst:
        rtnpath = step0_getjs2csvpre(wd)
        egpth = step1_findincompatiblejson(rtnpath)
        step2_show_point_singlwd(egpth)
